docs(readme): 使用 Mermaid 美化整体架构图
